Revit 2024 API
BuiltInFailures.InfillFailures.InPlaceFamilyNotCuttingHost Property
 Instance of in-place family is not cutting host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InPlaceFamilyNotCuttingHost { get; }
Visual Basic
Public Shared ReadOnly Property InPlaceFamilyNotCuttingHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InPlaceFamilyNotCuttingHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.InfillFailures Class
Autodesk.Revit.DB Namespace